25DanSa/Motion-Tracking-VL53L7CX-ToF-Sensor/MSPM0L1117_VL53L7CX_Motion_Presence_Tracker_v1.0/source/ti_msp_dl_config.h
/*
 * Copyright (c) 2023, Texas Instruments Incorporated - http://www.ti.com
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

/*
 *  ============ ti_msp_dl_config.h =============
 *  Configured MSPM0 DriverLib module declarations
 *
 *  DO NOT EDIT - This file is generated for the MSPM0L111X
 *  by the SysConfig tool.
 */
#ifndef ti_msp_dl_config_h
#define ti_msp_dl_config_h

#define CONFIG_MSPM0L111X
#define CONFIG_MSPM0L1117

#if defined(__ti_version__) || defined(__TI_COMPILER_VERSION__)
#define SYSCONFIG_WEAK __attribute__((weak))
#elif defined(__IAR_SYSTEMS_ICC__)
#define SYSCONFIG_WEAK __weak
#elif defined(__GNUC__)
#define SYSCONFIG_WEAK __attribute__((weak))
#endif

#include <ti/devices/msp/msp.h>
#include <ti/driverlib/driverlib.h>
#include <ti/driverlib/m0p/dl_core.h>

#ifdef __cplusplus
extern "C" {
#endif

/*
 *  ======== SYSCFG_DL_init ========
 *  Perform all required MSP DL initialization
 *
 *  This function should be called once at a point before any use of
 *  MSP DL.
 */


/* clang-format off */

#define POWER_STARTUP_DELAY                                                (16)


#define CPUCLK_FREQ                                                      4000000




/* Defines for CONFIG_I2C_0 */
#define CONFIG_I2C_0_INST                                                   I2C0
#define CONFIG_I2C_0_INST_IRQHandler                             I2C0_IRQHandler
#define CONFIG_I2C_0_INST_INT_IRQN                                 I2C0_INT_IRQn
#define CONFIG_I2C_0_BUS_SPEED_HZ                                         100000
#define GPIO_CONFIG_I2C_0_SDA_PORT                                         GPIOA
#define GPIO_CONFIG_I2C_0_SDA_PIN                                  DL_GPIO_PIN_0
#define GPIO_CONFIG_I2C_0_IOMUX_SDA                               (IOMUX_PINCM1)
#define GPIO_CONFIG_I2C_0_IOMUX_SDA_FUNC                IOMUX_PINCM1_PF_I2C0_SDA
#define GPIO_CONFIG_I2C_0_SCL_PORT                                         GPIOA
#define GPIO_CONFIG_I2C_0_SCL_PIN                                  DL_GPIO_PIN_1
#define GPIO_CONFIG_I2C_0_IOMUX_SCL                               (IOMUX_PINCM2)
#define GPIO_CONFIG_I2C_0_IOMUX_SCL_FUNC                IOMUX_PINCM2_PF_I2C0_SCL


/* Defines for CONFIG_UART_0 */
#define CONFIG_UART_0_INST                                                 UART0
#define CONFIG_UART_0_INST_FREQUENCY                                     4000000
#define CONFIG_UART_0_INST_IRQHandler                           UART0_IRQHandler
#define CONFIG_UART_0_INST_INT_IRQN                               UART0_INT_IRQn
#define GPIO_CONFIG_UART_0_RX_PORT                                         GPIOA
#define GPIO_CONFIG_UART_0_TX_PORT                                         GPIOA
#define GPIO_CONFIG_UART_0_RX_PIN                                 DL_GPIO_PIN_11
#define GPIO_CONFIG_UART_0_TX_PIN                                 DL_GPIO_PIN_10
#define GPIO_CONFIG_UART_0_IOMUX_RX                              (IOMUX_PINCM22)
#define GPIO_CONFIG_UART_0_IOMUX_TX                              (IOMUX_PINCM21)
#define GPIO_CONFIG_UART_0_IOMUX_RX_FUNC               IOMUX_PINCM22_PF_UART0_RX
#define GPIO_CONFIG_UART_0_IOMUX_TX_FUNC               IOMUX_PINCM21_PF_UART0_TX
#define CONFIG_UART_0_BAUD_RATE                                           (9600)
#define CONFIG_UART_0_IBRD_4_MHZ_9600_BAUD                                  (26)
#define CONFIG_UART_0_FBRD_4_MHZ_9600_BAUD                                   (3)
/* Defines for CONFIG_UART_1 */
#define CONFIG_UART_1_INST                                                 UART1
#define CONFIG_UART_1_INST_FREQUENCY                                     4000000
#define CONFIG_UART_1_INST_IRQHandler                           UART1_IRQHandler
#define CONFIG_UART_1_INST_INT_IRQN                               UART1_INT_IRQn
#define GPIO_CONFIG_UART_1_RX_PORT                                         GPIOA
#define GPIO_CONFIG_UART_1_TX_PORT                                         GPIOA
#define GPIO_CONFIG_UART_1_RX_PIN                                  DL_GPIO_PIN_9
#define GPIO_CONFIG_UART_1_TX_PIN                                  DL_GPIO_PIN_8
#define GPIO_CONFIG_UART_1_IOMUX_RX                              (IOMUX_PINCM20)
#define GPIO_CONFIG_UART_1_IOMUX_TX                              (IOMUX_PINCM19)
#define GPIO_CONFIG_UART_1_IOMUX_RX_FUNC               IOMUX_PINCM20_PF_UART1_RX
#define GPIO_CONFIG_UART_1_IOMUX_TX_FUNC               IOMUX_PINCM19_PF_UART1_TX
#define CONFIG_UART_1_BAUD_RATE                                           (9600)
#define CONFIG_UART_1_IBRD_4_MHZ_9600_BAUD                                  (26)
#define CONFIG_UART_1_FBRD_4_MHZ_9600_BAUD                                   (3)





/* Port definition for Pin Group CONFIG_GPIO_LPn */
#define CONFIG_GPIO_LPn_PORT                                             (GPIOA)

/* Defines for PIN_A5: GPIOA.5 with pinCMx 10 on package pin 9 */
#define CONFIG_GPIO_LPn_PIN_A5_PIN                               (DL_GPIO_PIN_5)
#define CONFIG_GPIO_LPn_PIN_A5_IOMUX                             (IOMUX_PINCM10)
/* Port definition for Pin Group CONFIG_GPIO_I2C_RST */
#define CONFIG_GPIO_I2C_RST_PORT                                         (GPIOA)

/* Defines for PIN_A24: GPIOA.24 with pinCMx 54 on package pin 28 */
#define CONFIG_GPIO_I2C_RST_PIN_A24_PIN                         (DL_GPIO_PIN_24)
#define CONFIG_GPIO_I2C_RST_PIN_A24_IOMUX                        (IOMUX_PINCM54)
/* Port definition for Pin Group CONFIG_GPIO_INT */
#define CONFIG_GPIO_INT_PORT                                             (GPIOA)

/* Defines for PIN_A26: GPIOA.26 with pinCMx 59 on package pin 30 */
#define CONFIG_GPIO_INT_PIN_A26_PIN                             (DL_GPIO_PIN_26)
#define CONFIG_GPIO_INT_PIN_A26_IOMUX                            (IOMUX_PINCM59)


/* clang-format on */

void SYSCFG_DL_init(void);
void SYSCFG_DL_initPower(void);
void SYSCFG_DL_GPIO_init(void);
void SYSCFG_DL_SYSCTL_init(void);
void SYSCFG_DL_CONFIG_I2C_0_init(void);
void SYSCFG_DL_CONFIG_UART_0_init(void);
void SYSCFG_DL_CONFIG_UART_1_init(void);



#ifdef __cplusplus
}
#endif

#endif /* ti_msp_dl_config_h */
